{
  "firstName": "Marcus",
  "lastName": "Alenius",
  "brief": "I’m a senior at Carnegie Mellon University studying Artificial Intelligence. I am a published researcher, former AI/ML Software Development Engineer Intern at AWS, and former Head Teaching Assistant.",
  "heroButtons": [
    {
      "id": 0,
      "type": "contact",
      "text": "Contact and Links",
      "modal": {
        "title": "Contact and Links",
        "content": [
          {
            "id": 0,
            "title": "Email",
            "text": "marcus.alenius@gmail.com",
            "link": "mailto:marcus.alenius@gmail.com"
          },
          {
            "id": 1,
            "title": "LinkedIn",
            "text": "linkedin.com/in/marcusalenius",
            "link": "https://www.linkedin.com/in/marcusalenius/"
          },
          {
            "id": 2,
            "title": "GitHub",
            "text": "github.com/marcusalenius",
            "link": "https://github.com/marcusalenius"
          },
          {
            "id": 3,
            "title": "Google Scholar",
            "text": "scholar.google.com/",
            "link": "https://scholar.google.com/citations?user=fOZk6agAAAAJ"
          }
        ]
      }
    },
    {
      "id": 1,
      "type": "about",
      "text": "More About Me",
      "modal": {
        "title": "About Me",
        "content": {
          "row_0": [
            {
              "id": 0,
              "text": "Hi again — I’m Marcus Alenius, a Swedish American studying Artificial Intelligence at Carnegie Mellon University. I’m passionate about developing new machine learning technologies and sharing what I learn with others. My primary interests include machine learning systems, natural language processing, and computer systems."
            },
            {
              "id": 1,
              "text": "I served as Head Teaching Assistant for CMU’s largest course, ranked among the top five U.S. computer science classes by Bloomberg. I am also a published machine learning researcher, having recently co-developed a novel LLM-based metric for automated code reviews. My industry experience includes an internship with AWS on the Bedrock Model Optimization team, where I worked on heterogeneous disaggregated inference."
            }
          ],
          "row_1": [
            {
              "id": 0,
              "text": "Outside of technology, I am passionate about swimming, a sport I have loved my entire life. I am a former Swedish Age Group Champion in the 100 and 200 meters breaststroke. During my freshman year at Carnegie Mellon, I swam on the varsity swim team. For two years, I coached swimmers aged 7–11. Most recently, I announced swim meets in Sundsvall, Sweden, in 2022 and 2024, for which I developed an application to collect live stats for the announcer. In 2024, I also served as one of the announcers for the Swedish Age Group Championships."
            }
          ]
        }
      }
    }
  ],
  "sections": {
    "Explainers": {
      "id": 0,
      "cards": [
        {
          "id": 0,
          "title": "Attention From Scratch",
          "subtitle": "Developing Intuition Behind the Core Idea in Modern AI",
          "link": "/attention"
        }
      ]
    },
    "Projects": {
      "id": 1,
      "cards": [
        {
          "id": 0,
          "title": "Needle",
          "subtitle": "A deep learning framework built from scratch with reverse-mode autodiff and hardware-accelerated tensor operations",
          "link": "/needle"
        },
        {
          "id": 1,
          "title": "Speech Transformer",
          "subtitle": "An encoder-decoder Transformer for automatic speech recognition",
          "link": "/speech-transformer"
        },
        {
          "id": 2,
          "title": "Actordentify",
          "subtitle": "Chrome extension that identifies actors in TV shows",
          "link": "/actordentify"
        }
      ],
      "additional": {
        "title": "Additional Projects",
        "categories": [
          {
            "id": 0,
            "title": "AI/ML",
            "projects": [
              {
                "id": 0,
                "title": "Transformer Langue Model",
                "short_title": "Transformer LM",
                "description": "Decoder-only Transformer language model built from scratch in PyTorch, achieving a per-character perplexity of 3.4. Built a decoder-only Transformer language model from scratch in PyTorch, including character- and subword-level tokenization, causal and padding masks, sinusoidal positional encodings, and multi-head self-attention. The model was trained using a custom training loop and achieved a final per-character perplexity of 3.4.",
                "date": "Apr 2025",
                "post_link": null,
                "github_link": null
              },
              {
                "id": 1,
                "title": "Phoneme Transcriber",
                "short_title": "Phoneme Transcriber",
                "description": "RNN-based sequence-to-sequence speech-to-phoneme transcriber achieving a 4.6 Levenshtein distance under a 20M parameter budget. Developed a sequence-to-sequence model that transcribes speech utterances into phoneme sequences using LSTMs and beam search decoding. The system was implemented entirely in PyTorch under an RNN-only constraint and a 20M parameter budget. It was trained with CTC loss and incorporates data augmentation techniques (SpecAugment and Gaussian noise) and regularization strategies, including locked dropout, optimized through ablation studies. The final model achieved a Levenshtein distance of 4.6 on held-out data.",
                "date": "Mar 2025",
                "post_link": null,
                "github_link": null
              },
              {
                "id": 2,
                "title": "Face Identifier and Classifier",
                "short_title": "Face Identifier",
                "description": "Face classification and verification model achieving a 2.4 Equal Error Rate (EER) under a 30M parameter constraint. Built and trained a face classification and verification model under a 30M parameter constraint, leveraging modified ResNet-50 and ConvNeXt architectures. The system was optimized for open-set identity recognition through ArcFace loss fine-tuning, improving the discriminability of learned face embeddings. Data augmentation was handled through a custom RandAugment pipeline incorporating geometric and photometric transformations. The model placed in the top 5% of a Carnegie Mellon graduate-level Kaggle competition.",
                "date": "Feb 2025",
                "post_link": null,
                "github_link": null
              },
              {
                "id": 3,
                "title": "Minesweeper Solver",
                "short_title": "Minesweeper Solver",
                "description": "Minesweeper solver implemented using SAT solving over boolean equation representations of board states. Developed a Minesweeper solver in Standard ML by representing board states as systems of boolean equations. Flags were denoted as 0 and safe squares as 1; for each revealed square, an equation constrained its warning number to equal the sum of the values of its neighboring variables. To solve these equations, I implemented a SAT solver using unit propagation and the DPLL algorithm. The solver enumerated all satisfying assignments, from which a provably safe square was selected to reveal.",
                "date": "Nov 2023",
                "post_link": null,
                "github_link": null
              },
              {
                "id": 4,
                "title": "Kenboard",
                "short_title": "Kenboard",
                "description": "Virtual keyboard featuring a custom typing error correction system enabling up to 80% faster typing. Developed as a term project for Carnegie Mellon’s 15-112 Fundamentals of Programming and Computer Science, this virtual keyboard implements a custom typing error correction system. Inspired by Ken Kocienda’s Creative Selection, it combines a Manhattan distance-based algorithm with word usage frequency to infer the most probable user-intended word, enabling up to 80% faster typing.",
                "date": "Apr 2023",
                "post_link": "/kenboard",
                "github_link": null
              }
            ]
          },
          {
            "id": 1,
            "title": "Computer Systems",
            "projects": [
              {
                "id": 0,
                "title": "Multithreaded File System",
                "short_title": "File System",
                "description": "Concurrent FAT-style file system redesign focused on correctness, scalability, and thread safety. Reengineered a FAT-style file system to support full concurrency using C and POSIX threads. Implemented a two-pronged synchronization strategy with a global mutex for system-level coordination and readers–writer locks for file-level access, allowing exclusive access to each file to be controlled independently. This design resolved 100% of race conditions identified by LLVM task graph analysis tooling.",
                "date": "Apr 2024",
                "post_link": null,
                "github_link": null
              },
              {
                "id": 1,
                "title": "Concurrent Web Proxy",
                "short_title": "Web Proxy",
                "description": "Thread-safe, multithreaded HTTP proxy server designed for high-concurrency network workloads. Implemented a multithreaded HTTP proxy server using POSIX threads with a protocol-independent, thread-safe architecture capable of handling multiple concurrent client connections. Developed robust request parsing and error handling, including integration of a custom HTTP parser and validation mechanisms to ensure correct communication between clients and servers. The system met 100% of prescribed performance objectives under concurrent load.",
                "date": "Apr 2024",
                "post_link": null,
                "github_link": null
              },
              {
                "id": 2,
                "title": "Linux Shell",
                "short_title": "Linux Shell",
                "description": "Custom Linux shell implementing signal-based job control and process management. Implemented a Linux shell in C supporting foreground and background process execution with signal-based job control. The shell handles I/O redirection and manages SIGINT and SIGTSTP signals for foreground jobs. The implementation emphasizes safe, resource-efficient process management by reaping terminated processes and protecting against race conditions.",
                "date": "Apr 2024",
                "post_link": null,
                "github_link": null
              },
              {
                "id": 3,
                "title": "Dynamic Memory Allocator",
                "short_title": "Memory Allocator",
                "description": "Dynamic memory allocator built on a segregated free list, optimized for throughput and fragmentation. Implemented a custom heap allocator in C supporting malloc, free, realloc, and calloc using a segregated free list design. The project involved analyzing and balancing throughput versus memory utilization to achieve a fast allocator with minimal heap fragmentation. The implementation ranked in the top 8% of the Carnegie Mellon intro computer systems course.",
                "date": "Mar 2024",
                "post_link": null,
                "github_link": null
              },
              {
                "id": 4,
                "title": "Cache Memory Simulator",
                "short_title": "Cache Simulator",
                "description": "Command-line cache simulator modeling LRU replacement and write-back, write-allocate policies. Wrote a command-line tool in C that simulates the behavior of a hardware cache given memory access traces. The simulator implements an LRU (least-recently used) replacement policy and follows a write-back, write-allocate design. For arbitrary cache sizes and associativities, it reports cache hits, misses, evictions, dirty bytes, and evicted dirty bytes.",
                "date": "Feb 2024",
                "post_link": null,
                "github_link": null
              },
              {
                "id": 5,
                "title": "Virtual Machine",
                "short_title": "Virtual Machine",
                "description": "Stack-based virtual machine for executing safe subsets of C with dynamic runtime checks. Implemented a virtual machine for the C0 and C1 languages, which are safe subsets of C. Influenced by the JVM, the system is implemented as a stack machine in C and uses an operand stack, call stack, local variable array, program counter, and constant and function pools. The virtual machine executes arbitrary C0/C1 programs while enforcing dynamic safety checks for heap allocation, array accesses, pointer casts and dereferences, and other runtime invariants.",
                "date": "Dec 2023",
                "post_link": null,
                "github_link": null
              }
            ]
          },
          {
            "id": 2,
            "title": "Web Development",
            "projects": [
              {
                "id": 0,
                "title": "Swim Info",
                "short_title": "Swim Info",
                "description": "Web application for collecting and presenting swim meet statistics for live announcers. Designed and implemented an application to collect swim statistics for announcers at swim meets, consisting of a web scraper and user interface built with Python and Beautiful Soup. The system processes start lists and scrapes online meet results to extract split times for each swimmer’s best performance. I developed the app to enhance the audience experience during swim meets I announced in 2024.",
                "date": "May 2024",
                "post_link": null,
                "github_link": "https://github.com/marcusalenius/swim-info"
              },
              {
                "id": 1,
                "title": "Personal Website",
                "short_title": "Personal Website",
                "description": "Personal website (this website) designed and built from scratch using React and Next.js. Inspired by olivierifrah.com and apple.com, with a focus on a responsive design that looks great in light and dark appearance with effortless and lightweight interactions. This project is a chance for me to explore my more creative side.",
                "date": "May 2024",
                "post_link": null,
                "github_link": "https://github.com/marcusalenius/marcusalenius.github.io"
              },
              {
                "id": 2,
                "title": "Investigation Tracking System",
                "short_title": "Tracking System",
                "description": "Full-stack, multi-user web application for managing simulated criminal investigation case data. Developed a full-stack, multi-user web application using Ruby on Rails with SQLite for the backend and React for the frontend, enabling fast access to case data in a simulated criminal investigation database. Built using test-driven development, achieving 100% unit test coverage. The backend emphasizes maintainability and scalability, while the frontend provides a dynamic user interface. Additionally, I developed and documented 12 REST API endpoints with token-based authentication, authorization, and versioning.",
                "date": "Feb 2024 – Apr 2024",
                "post_link": null,
                "github_link": null
              }
            ]
          }
        ]
      }
    },
    "Experience": {
      "id": 2,
      "cards": [
        {
          "id": 0,
          "title": "SDE Intern, AI/ML",
          "organization": "Amazon Web Services",
          "start": "May 2025",
          "end": "Aug 2025",
          "location": "Santa Clara, CA",
          "description": "Heterogeneous disaggregated inference for LLM serving in Bedrock"
        },
        {
          "id": 1,
          "title": "Undergraduate Researcher",
          "organization": "Language Technologies Institute, CMU",
          "start": "May 2024",
          "end": "Aug 2024",
          "location": "Remote",
          "description": "LLM-based evaluation metric for automated code reviews"
        }
      ],
      "additional": {
        "title": "Additional Experience",
        "experience": [
          {
            "id": 0,
            "title": "Head Teaching Assistant",
            "organization": "School of Computer Science, CMU",
            "start": "Aug 2023",
            "end": "Dec 2025",
            "location": "Pittsburgh, PA",
            "description": "Course leadership and infrastructure for 15-112 Fundamentals of Programming"
          },
          {
            "id": 1,
            "title": "Research Intern",
            "organization": "Human-Computer Interaction Institute, CMU",
            "start": "May 2023",
            "end": "Aug 2023",
            "location": "Pittsburgh, PA",
            "description": "Intelligent tutoring system for community college IT education"
          }
        ]
      }
    },
    "Publications": {
      "id": 3,
      "cards": [
        {
          "id": 0,
          "title": "CRScore: Grounding Automated Evaluation of Code Review Comments in Code Claims and Smells",
          "authors": "Atharva Naik, Marcus Alenius, Daniel Fried, Carolyn Rose",
          "conference": "NAACL",
          "year": "2025",
          "link": "https://arxiv.org/abs/2409.19801"
        }
      ],
      "additional": {
        "title": "Additional Publications",
        "publications": [
          {
            "id": 0,
            "title": "Community College Information Technology Education: Curriculum Mapping, a Learning Science Framework, and AI Learning Technologies",
            "authors": "Bruce McLaren, Lauren Herckis, Leah Teffera, Lee Branstetter, Carolyn Rose, Majd Sakr, Matthew Kisow, Reis Reis, Michael Rinsem, Marcus Alenius, Lex Miller",
            "conference": "American Educational Research Association",
            "year": "2024",
            "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=fOZk6agAAAAJ&citation_for_view=fOZk6agAAAAJ:u5HHmVD_uO8C"
          }
        ]
      }
    }
  },
  "posts": {
    "actordentify": {
      "title": "Actordentify",
      "intro": "Chrome extension that identifies and overlays information about actors in TV shows. Uses Amazon Rekognition and TMDB APIs to identify actors and provide details.",
      "date": "August 2023",
      "links": {
        "github_link": "https://github.com/rwelgosh/ActorRecognizer"
      },
      "youtube_link": null,
      "markdown": "actordentify.md"
    },
    "kenboard": {
      "title": "Kenboard",
      "intro": "Virtual keyboard with a custom typing error correction system. My term project for Carnegie Mellon's 15-112 Fundamentals of Programming and Computer Science. Written in Python using the Kivy app development framework.",
      "date": "April 2023",
      "links": null,
      "youtube_link": "https://www.youtube.com/embed/GL7kLWBDsWU",
      "markdown": "kenboard.md"
    },
    "attention": {
      "title": "Attention From Scratch: Developing Intuition Behind the Core Idea in Modern AI",
      "intro": "How do large language models work? Together, we will develop intuition behind the core idea that makes them possible — attention.",
      "date": "August 2025",
      "links": null,
      "youtube_link": null,
      "markdown": "attention.md"
    },
    "needle": {
      "title": "Needle",
      "intro": "A deep learning framework built from scratch, featuring a reverse-mode automatic differentiation engine and tensor operations accelerated on CPU, CUDA, and Metal.",
      "date": "November 2025",
      "links": null,
      "youtube_link": null,
      "markdown": "needle.md"
    },
    "speech-transformer": {
      "title": "Speech Transformer",
      "intro": "An encoder-decoder Transformer for automatic speech recognition.",
      "date": "April 2025",
      "links": null,
      "youtube_link": null,
      "markdown": "speech-transformer.md"
    },
    "cuda-matmul": {
      "title": "CUDA Matmul",
      "intro": "Foo.",
      "date": "Date",
      "links": null,
      "youtube_link": null,
      "markdown": "cuda-matmul.md"
    }
  }
}
